package dom.enums;

/**
 * Класс стилей CSS.  
 * Этот енум содержит перечисление всех используемых классов
 * стилей библиотекой `HaxeDOM`, в одном месте.
 * 
 * Тут их можно посмотреть или изменить, если нужно.
 */
@:dce
enum abstract CSSClass(String) to String from String
{
    ///////////////////////
    //   UI КОМПОНЕНТЫ   //
    ///////////////////////

    /**
     * Поле с текстом.  
     * Используется для обозначения экземпляра: `dom.ui.Label`
     */
    var UI_LABEL = "ui_label";

    /**
     * Кнопка UI.  
     * Используется для обозначения экземпляра: `dom.ui.Button`
     */
    var UI_BUTTON = "ui_button";

    /**
     * Изображение.  
     * Используется для обозначения экземпляра: `dom.ui.Image`
     */
    var UI_IMAGE = "ui_image";

    /**
     * Базовый элемент ввода.  
     * Используется для обозначения экземпляра: `dom.ui.Input`
     */
    var UI_INPUT = "ui_input";

    /**
     * Поле ввода однострочного текста.  
     * Используется для обозначения экземпляра: `dom.ui.InputText`
     */
    var UI_INPUT_TEXT = "ui_input_text";

    /**
     * Радил-кнопка.  
     * Используется для обозначения экземпляра: `dom.ui.RadioButton`
     */
    var UI_RADIO = "ui_radio";



    ///////////////////
    //   СОСТОЯНИЯ   //
    ///////////////////

    /**
     * Обязательный элемент.  
     * Используется для обозначения обязательного компонента
     * или поля для заполнения.
     * 
     * *п.с.: Не путать с классом описания требования: `REQUIRE`*
     */
    var REQUIRED = "required";

    /**
     * Элемент выключен.  
     * Используется для обозначения выключенного элемента,
     * например: `dom.ui.Button.disabled=true`
     */
    var DISABLED = "disabled";

    /**
     * Некорректное содержимое.  
     * Используется для обозначения элементов ввода, заполненных
     * с ошибками, например: `dom.ui.InputText`
     */
    var WRONG = "wrong";



    //////////////////////
    //   ПРОСТЫЕ ТИПЫ   //
    //////////////////////

    /**
     * Текстовая метка.  
     * Используется для обозначения текста в кнопках или других
     * ui компонентах, которые могут содержать собственное
     * текстовое поле.
     */
    var LABEL = "label";

    /**
     * Ошибка.  
     * Используется для обозначения ошибки. Например, в полях
     * ввода при неудачной валидации.
     */
    var ERROR = "error";

    /**
     * Предупреждение.  
     * Используется для обозначения важной информации.
     */
    var WARN = "warn";

    /**
     * Описание обязательного заполнения.  
     * Используется для обозначения текста обязательного заполнения.
     * 
     * *п.с.: Не путать с классом состояния: `REQUIRED`*
     */
    var REQUIRE = "require";
}